{
  "basics": {
    "name": "Chester Burbidge",
    "label": "Software Engineer",
    "picture": "",
    "email": "a@b.com",
    "phone": "",
    "website": "",
    "summary": "An ambitious Software Engineer with a passion for self-development who is constantly trying to learn, practice and improve in all aspects of software development. New technologies and paradigms discovered through reading books and articles, listening to podcasts, attending talks and personal projects.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "UK",
      "region": "Bristol"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "burbdude",
        "url": "https://twitter.com/burbdude"
      },
      {
        "network": "Github",
        "username": "CBurbidge",
        "url": "https://github.com/CBurbidge"
      }
    ]
  },
  "work": [
    {
      "company": "Abide Financial",
      "position": "Software Engineer",
      "website": "http://www.abide-financial.com/",
      "startDate": "2015-03-01",
      "summary": "",
      "highlights": [
        "Setup Continuous integration infrastructure using AWS and Teamcity and various integrations",
        "Setup Automated deployment using octopus deployment, devised solution for having multiple config files on multiple deployment targets.",
        "Devised contiuous deployment pipelines for AWS resources such as AWS Lambda functions",
        "Wrote libraries to help promote and implement best practices in build and deployment automation",
        "Implemented configuration of logging aggregation solution to production systems. Extensive use of remote powershell used.",
        "Wrote scripts for file archival and other windows server administration tasks",
        "Wrote "
      ]
    },
    {
      "company": "Fundslibrary",
      "position": "Junior Software Developer",
      "website": "https://www.fundslibrary.co.uk",
      "startDate": "2013-12-01",
      "endDate": "2014-12-01",
      "summary": "Maintaining and extending the Funds Library website and it's clients' customisations in a work environment based on Agile methodologies. Modern software development practices used including Test Driven Development, Automated Testing, Refactoring, Continuous Integration, SOLID craftmanship practices and development patterns.\nRole used C#, ASP.NET MVC and SQL Server to develop web sites, web services and internal tools. Client side development consisted of using typescript, LESS and javascript libraries such as KnockoutJs, jQuery, d3.js using grunt and jasmine for testing.",
      "highlights": [
        "Fix cross side scripting vulnerability in internal apps in accordance to external.",
        "Implemented exponentially increasing locking out login page to stop repeated incorrect attempts.",
        "Created client side javascript error handler with corresponding server side error reporting.",
        "Discovered and fixed bugs at all levels of web development stack, from DB to js.",
        "Devised clean method of using LESS to assign colours to charts."
      ]
    },
    {
      "company": "Toplevel Computing Ltd",
      "position": "Graduate Software Developer",
      "website": "https://www.toplev.com/",
      "startDate": "2013-03-01",
      "endDate": "2014-03-01",
      "summary": "Extending or performing maintenance on customer or internal systems, using in-house developed software analogous to Web Forms, combined with the .Net Framework and other technologies. Role involved understanding client's requests, writing code specications, designs and performing the implementation of code changes, in a workplace that practices agile methodologies.",
      "highlights": [
        "Learnt about in-house developed bespoke software and various custom client implementations.",
        "Debugged and diagnosed problems in clients systems and liased with clients to provide solutions.",
        "Developed changes to clients system to allow batch creation and downloading of reports.",
        "Created prototype for presentation pitch for new client business. This included 'smoke and mirrors' features and generation of random data for presentation.",
        "Implemented client payment system by extending existing payment code infrastucture."
      ]
    },
    {
      "company": "University of Exeter",
      "position": "Graduate teaching assistant",
      "website": "http://www.exeter.ac.uk/",
      "startDate": "2010-10-01",
      "endDate": "2012-02-01",
      "summary": "Teaching undergraduate students mathematics and demonstrating first year laboratory experiments."
    },
    {
      "company": "Scats Country Store",
      "position": "Retail assistant",
      "startDate": "2006-11-01",
      "endDate": "2007-09-01",
      "summary": "Customer service, stock rotation, cleaning and till operation."
    },
    {
      "company": "Burbidge's Bakery",
      "position": "Bakery Helper",
      "website": "http://www.burbidges.co.uk/",
      "startDate": "2002-06-01",
      "endDate": "2007-09-01",
      "summary": "Various roles including helping customers, preparing food and cleaning."
    }
  ],
  "volunteer": [
    {
      "organization": "Codeclub",
      "position": "Club leader",
      "website": "https://www.codeclub.org.uk/",
      "startDate": "2015-10-01",
      "endDate": "2016-04-01",
      "summary": "After school club for primary school children. Taught scratch, HTML CSS and python."
    },
    {
      "organization": "Codeclub",
      "position": "Club leader",
      "website": "https://www.codeclub.org.uk/",
      "startDate": "2013-09-01",
      "endDate": "2014-04-01",
      "summary": "After school club for primary school children. Taught scratch, HTML CSS and python."
    }
  ],
  "education": [
    {
      "institution": "University of Oklahoma",
      "area": "Information Technology",
      "studyType": "Bachelor",
      "startDate": "2011-06-01",
      "endDate": "2014-01-01",
      "gpa": "4.0",
      "courses": [
        "DB1101 - Basic SQL",
        "CS2011 - Java Introduction"
      ]
    }
  ],
  "interests": [
    {
      "name": "Music",
      "keywords": [
        "Guitar"
      ]
    },
    {
      "name": "Music",
      "keywords": [
        "Guitar"
      ]
    }
  ]
}