{
  "basics": {
    "name": "Chester Burbidge",
    "label": "Software Engineer",
    "website": "www.chesterburbidge.com",
    "picture": "",
    "summary": "An ambitious Software Engineer with a passion for self-development who is constantly trying to learn, practice and improve in all aspects of software development. New technologies and paradigms discovered through reading books and articles, listening to podcasts, attending talks and personal projects.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "burbdude",
        "url": "https://twitter.com/burbdude"
      },
      {
        "network": "Github",
        "username": "CBurbidge",
        "url": "https://github.com/CBurbidge"
      }
    ]
  },
  "work": [
    {
      "company": "Scott Logic",
      "position": "Software Engineer",
      "website": "https://www.scottlogic.com/",
      "startDate": "2017-10-16",
      "summary": "",
      "highlights": [
        "Designed and implemented ETL pipeline on Azure using Data Factory V2 and Azure Resource Manager. Helped design and implement datawarehouse reporting solution for client using Azure SQL DataWarehouse."
      ]
    },
    {
      "company": "Abide Financial",
      "position": "Software Engineer",
      "website": "http://www.abide-financial.com/",
      "startDate": "2015-03-01",
      "endDate": "2017-10-15",
      "summary": "",
      "highlights": [
        "Produced or maintained code to efficiently enrich and validate transaction data using primarily C# and SQL, but also python",
        "Devised and setup Continuous Integration and Deployment infrastructure and conventions for AWS resources including EC2 and Lambda. This consisted primarily of Teamcity and Octopus deploy.",
        "Created nuget packages to help promote and implement best practices in build and deployment automation",
        "Implemented configuration of logging aggregation solution to remote production systems. This involved extensive automation with powershell.",
        "Wrote scripts and programs for file archival and other windows server administration tasks",
        "Spread best practices in methods and technologies through organising department wide, weekly workshops.",
        "Extensive use of automation technologies like powershell, AWS Cloudformation and Chef."
      ]
    },
    {
      "company": "Fundslibrary",
      "position": "Junior Software Developer",
      "website": "https://www.fundslibrary.co.uk",
      "startDate": "2013-12-01",
      "endDate": "2014-12-01",
      "summary": "Maintaining and extending the Funds Library website and it's clients' customisations in a work environment based on Agile methodologies. Modern software development practices used including Test Driven Development, Automated Testing, Refactoring, Continuous Integration, SOLID craftmanship practices and development patterns.\nRole used C#, ASP.NET MVC and SQL Server to develop web sites, web services and internal tools. Client side development consisted of using typescript, LESS and javascript libraries such as KnockoutJs, jQuery, d3.js using grunt and jasmine for testing."
    },
    {
      "company": "Toplevel Computing Ltd",
      "position": "Graduate Software Developer",
      "website": "https://www.toplev.com/",
      "startDate": "2013-03-01",
      "endDate": "2014-03-01",
      "summary": "Extending or performing maintenance on customer or internal systems, using in-house developed software analogous to Web Forms, combined with the .Net Framework and other technologies. Role involved understanding client's requests, writing code specications, designs and performing the implementation of code changes, in a workplace that practices agile methodologies."
    },
    {
      "company": "University of Exeter",
      "position": "Graduate teaching assistant",
      "website": "http://www.exeter.ac.uk/",
      "startDate": "2010-10-01",
      "endDate": "2012-02-01",
      "summary": "Teaching undergraduate students mathematics and demonstrating first year laboratory experiments."
    }
  ],
  "volunteer": [
    {
      "organization": "Codeclub",
      "position": "Club leader",
      "website": "https://www.codeclub.org.uk/",
      "startDate": "2015-10-01",
      "endDate": "2016-04-01",
      "summary": "After school club for primary school children. Taught scratch, HTML CSS and python."
    },
    {
      "organization": "Codeclub",
      "position": "Club leader",
      "website": "https://www.codeclub.org.uk/",
      "startDate": "2013-09-01",
      "endDate": "2014-04-01",
      "summary": "After school club for primary school children. Taught scratch, HTML CSS and python."
    }
  ],
  "education": [
    {
      "institution": "The University of Exeter",
      "startDate": "2010-10-01",
      "endDate": "2012-10-01",
      "studyType": "Phd Physics: The electrical properties of cell membranes",
      "gpa": "Degree Not Attained"
    },
    {
      "institution": "The University of Exeter",
      "startDate": "2007-09-01",
      "endDate": "2010-09-01",
      "studyType": "BSc. (Hons.) Mathematics and Physics",
      "gpa": "2:1"
    },
    {
      "institution": "Queen Mary's College",
      "startDate": "2005-09-01",
      "endDate": "2007-09-01",
      "studyType": "A Levels",
      "gpa": "Mathematics (A), Physics (B), Electronics (B), BTEC Music Practice (Distinction). AS Level: Further Mathematics AS (C)"
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [],
  "languages": [],
  "interests": [],
  "references": []
}